In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

s = pd.Series(range(1, 11))
s[3] = np.nan
s

0     1.0
1     2.0
2     3.0
3     NaN
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [4]:
s.count() # 데이터 갯수 세기(NaN값은 세지 않음)

9

In [6]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float, columns=['A','B','C','D'])
df.iloc[2, 3] = np.nan
df

     A    B    C    D
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [7]:
df.count() # 데이터 프레임에서는 열별로 데이터를 센다

A    4
B    4
C    4
D    3
dtype: int64

In [8]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
# 연습문제 - 타이타닉 호 승객의 데이터 개수를 각 열별로 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [12]:
# 카테고리 값 세기
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size = 100))
s2.head()

0    5
1    3
2    4
3    0
4    1
dtype: int32

In [13]:
s2.value_counts() # 시리즈의 값이 정수, 문자열, 카테고리 값인 경우 value_count()메소드로 값이 나온 횟수를 구할 수 있음

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [21]:
df['A'].value_counts() # 데이터 프레임의 경우(메소드 보유X) 각 열마다 별도 적용해줘야 한다.

3.0    2
0.0    1
4.0    1
Name: A, dtype: int64

In [22]:
# 정렬
s2.value_counts().sort_index() # sort_index <- 인덱스 값을 기준으로 정렬

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [23]:
s.sort_values() # 데이터 값 기준 정렬, NaN 값은 맨 뒤로 정렬된다.

0     1.0
1     2.0
2     3.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
3     NaN
dtype: float64

In [24]:
s.sort_values(ascending=False) # 역순 정렬

9    10.0
8     9.0
7     8.0
6     7.0
5     6.0
4     5.0
2     3.0
1     2.0
0     1.0
3     NaN
dtype: float64

In [26]:
df.sort_values(by='B') # 데이터 프레임에서 정렬 메소드를 사용하는 경우 by 인수로 기준이되는 열을 지정해줘야함

     A    B    C    D
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [28]:
df.sort_values(by=['B', 'C']) # by 인수에 리스트 값을 넣으면 순서대로 정렬의 우선 순위가 된다.

     A    B    C    D
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [35]:
# 연습문제
# sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
titanic['sex'].sort_values().value_counts()

male      577
female    314
Name: sex, dtype: int64

In [36]:
titanic['age'].sort_values().value_counts()

24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Name: age, Length: 88, dtype: int64

In [37]:
titanic['class'].sort_values().value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [38]:
titanic['alive'].sort_values().value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [41]:
# 행/열 합계
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [42]:
df2.sum(axis=1) # 행 방향 합계 구하기

0    35
1    34
2    41
3    42
dtype: int64

In [43]:
df2["RowSum"] = df2.sum(axis=1) # 행방향 합계로 새로운 열 생성
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [45]:
df2.sum() # 열방향 합계 구하기(axis 인수의 디폴트 값이 0 이기에 axis=0 생략)

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [47]:
df2.loc['ColTotal',:] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

In [48]:
""" 
연습 문제
타이타닉호 승객의 평균 나이를 구하라.

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
"""

In [49]:
titanic['age'].mean() # 승객 평균 나이

29.69911764705882

In [56]:
titanic.loc[titanic.sex=='female']['age'].mean() # 여성 승객 평균 나이

27.915708812260537

In [61]:
titanic.loc[(titanic['sex']=='female') & (titanic['class']=='First')]['age'].mean() # 1등실 여성 평균 나이

34.61176470588235